In [1]:
import sys; sys.path.append("../")

import pandas as pd

from lib.explore import show_unique
from clean.new_orleans_pd_pprr import clean

In [2]:
df = clean()
df

,employee_id,birth_year,department_code,rank_code,rank_desc,badge_no,last_name,first_name,middle_initial,data_production_year,agency,uid,middle_name,department_desc,hire_year,hire_month,hire_day
0,569,1963,2702736,C7134,senior police officer,00911,conway,corliss,d,2019,New Orleans PD,8b16ebc056e613024c057be590b542eb,NaN,NaN,NaN,NaN,NaN
1,1369,1969,2702734,C7110,police officer,01226,kendrick,jamal,d,2019,New Orleans PD,0e3a37aa85a14e359df74fa77eded3f6,NaN,NaN,NaN,NaN,NaN
2,1391,1978,2702734,C7134,senior police officer,02101,marshall,tianay,m,2019,New Orleans PD,7f53f8c6c730af6aeb52e66eb74d8507,NaN,NaN,NaN,NaN,NaN
3,1599,1975,2702750,C7134,senior police officer,01580,weber,tamara,l,2019,New Orleans PD,83e8ef518174e1eb6be4a0778d050c9d,NaN,NaN,NaN,NaN,NaN
4,2507,1969,2702705,U0018,assistant supt of police,,pierce,arlinda,g,2019,New Orleans PD,83691715fdc5baf20ed0742b0b85785b,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1597,10445,1971,2702731,C7110,police officer,,gagnon,chad,c,1999,New Orleans PD,35c5ce55d4c6015406e3f53558e5bed2,NaN,NaN,NaN,NaN,NaN
1598,10446,1974,2702731,C7110,police officer,,martin,christopher,d,1999,New Orleans PD,0d5501edb21a59a43435efa67f200828,NaN,NaN,NaN,NaN,NaN
1599,10898,1952,2702736,C7134,senior police officer,,talley,david,,1999,New Orleans PD,3bbca1d243b01b47c2bf42b29a8b265c,NaN,NaN,NaN,NaN,NaN
1600,11432,1973,2702780,C7110,police officer,,gex,nathan,,1999,New Orleans PD,57335eb19f0669886d99414968f976c3,NaN,NaN,NaN,NaN,NaN
1601,13861,1957,2702737,C7133,police officer 3,,guggenheim,gary,,1999,New Orleans PD,320274ee8b7f2e8a82d37d07f64c0e0b,NaN,NaN,NaN,NaN,NaN

In [19]:
perdf = pd.read_csv("../data/fuse/per_new_orleans_pd.csv")
perdf

,uid,last_name,middle_name,middle_initial,first_name,birth_year
0,8b16ebc056e613024c057be590b542eb,conway,NaN,d,corliss,1963.0
1,0e3a37aa85a14e359df74fa77eded3f6,kendrick,NaN,d,jamal,1969.0
2,7f53f8c6c730af6aeb52e66eb74d8507,marshall,NaN,m,tianay,1978.0
3,83e8ef518174e1eb6be4a0778d050c9d,weber,NaN,l,tamara,1975.0
4,83691715fdc5baf20ed0742b0b85785b,pierce,NaN,g,arlinda,1969.0
...,...,...,...,...,...,...
4274,b578f2a52a0229873fefc2a4b06377fa,gonzales,NaN,NaN,alfred,1973.0
4275,db0cf003e7db9592288d809665cfeb2a,hajek,NaN,j,clinton,1975.0
4276,47e57c4836ae0c44f774f9d8497e0b4f,allen,NaN,w,timothy,1969.0
4277,7fc0e8de9ce1ab7d9b6c435a08a8b0d9,waterman,NaN,w,winson,1973.0
4278,8c2d7d2728733cad5681b6b79ae799e4,robinson,NaN,m,treece,1965.0

In [23]:
records = dict()
for _, row in perdf.iterrows():
    if row.uid not in records:
        records[row.uid] = {"uid": row.uid}
    record = records[row.uid]
    for col in ["last_name", "middle_name", "middle_initial", "first_name", "birth_year"]:
        if not pd.isnull(row[col]):
            record[col] = row[col]
pd.DataFrame.from_records(list(records.values()))

,uid,last_name,middle_initial,first_name,birth_year,middle_name
0,8b16ebc056e613024c057be590b542eb,conway,d,corliss,1963.0,NaN
1,0e3a37aa85a14e359df74fa77eded3f6,kendrick,d,jamal,1969.0,NaN
2,7f53f8c6c730af6aeb52e66eb74d8507,marshall,m,tianay,1978.0,NaN
3,83e8ef518174e1eb6be4a0778d050c9d,weber,l,tamara,1975.0,NaN
4,83691715fdc5baf20ed0742b0b85785b,pierce,g,arlinda,1969.0,NaN
...,...,...,...,...,...,...
3093,b578f2a52a0229873fefc2a4b06377fa,gonzales,NaN,alfred,1973.0,NaN
3094,db0cf003e7db9592288d809665cfeb2a,hajek,j,clinton,1975.0,NaN
3095,47e57c4836ae0c44f774f9d8497e0b4f,allen,w,timothy,1969.0,NaN
3096,7fc0e8de9ce1ab7d9b6c435a08a8b0d9,waterman,w,winson,1973.0,NaN
3097,8c2d7d2728733cad5681b6b79ae799e4,robinson,m,treece,1965.0,NaN